In [1]:
import pandas as pd
import numpy as np

In [2]:
# Creating the dataframes
dataframes=[]
for i in range(1,73):
    k1='df'
    k2=str(i)
    k=k1+k2
    dataframes.append(k)

In [3]:
# Creating the datafiles name
flight=[]
for i in range(1,73):
    k1='flight_data_'
    k2=str(i)
    k3='.csv'
    k=k1+k2+k3
    flight.append(k)

In [4]:
#importing all the dataframe
k=0
for i in dataframes:
    locals()[i]=pd.read_csv(flight[k])
    k=k+1

In [5]:
df_list=[]
for i in dataframes:
    df_list.append(locals()[i])

In [6]:
df=pd.DataFrame()
df = df.append(df_list)

In [7]:
df.head()

,Unnamed: 0,Company Name,Departure time,Arrival Time,Duration,No of stops,Rates,No of days in advanced booked,class,where to where,Root Value
0,0,Air Asia,08:00,14:35,6h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
1,1,Air Asia,09:25,16:00,6h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
2,2,Air Asia,12:40,20:15,7h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
3,3,Air Asia,11:55,20:15,8h 20m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
4,4,Air Asia,08:00,16:35,8h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3

In [8]:
df.shape

(1587, 11)

In [9]:
df.columns

Index(['Unnamed: 0', 'Company Name', 'Departure time', 'Arrival Time',
       'Duration', 'No of stops', 'Rates', 'No of days in advanced booked',
       'class', 'where to where', 'Root Value'],
      dtype='object')

In [10]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [11]:
df.head()

,Company Name,Departure time,Arrival Time,Duration,No of stops,Rates,No of days in advanced booked,class,where to where,Root Value
0,Air Asia,08:00,14:35,6h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
1,Air Asia,09:25,16:00,6h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
2,Air Asia,12:40,20:15,7h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
3,Air Asia,11:55,20:15,8h 20m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3
4,Air Asia,08:00,16:35,8h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3

In [12]:
df['Company Name'].value_counts()

Vistara Premium Economy    437
Air India Business         355
Vistara Business           195
IndiGo                     185
Go First                   140
Air Asia                    98
SpiceJet                    67
Air India                   56
Vistara                     54
Name: Company Name, dtype: int64

# Creating the dataset for tableau

**Column : Departure time**

In [13]:
dt_list=[]
for i in df['Departure time']:
    dt_list.append(i)
dt_int3=[]
for i in dt_list:
    k=i.split(':')
    dt_int1=int(k[0])
    dt_int2=int(k[1])/60
    dt_int3.append(round((dt_int1+dt_int2),2))

In [14]:
df['Departure Time']=dt_int3

In [15]:
df.drop('Departure time',axis=1,inplace=True)

**Column : Arrival time**

In [16]:
df1=pd.DataFrame()
list1=[]
for i in df['Company Name']:
    list1.append(i)
df1['Company Name']=list1
list2=[]
for i in df['Arrival Time']:
    list2.append(i)
df1['Arrival Time']=list2

list3=[]
for i in df['Duration']:
    list3.append(i)
df1['Duration']=list3

list4=[]
for i in df['No of stops']:
    list4.append(i)
df1['No of stops']=list4

list5=[]
for i in df['Rates']:
    list5.append(i)
df1['Rates']=list5

list6=[]
for i in df['No of days in advanced booked']:
    list6.append(i)
df1['No of days in advanced booked']=list6

list7=[]
for i in df['class']:
    list7.append(i)
df1['class']=list7

list8=[]
for i in df['where to where']:
    list8.append(i)
df1['where to where']=list8

list9=[]
for i in df['Root Value']:
    list9.append(i)
df1['Route Value']=list9

list10=[]
for i in df['Departure Time']:
    list10.append(i)
df1['Departure Time']=list10

df1.head()

,Company Name,Arrival Time,Duration,No of stops,Rates,No of days in advanced booked,class,where to where,Route Value,Departure Time
0,Air Asia,14:35,6h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,8.00
1,Air Asia,16:00,6h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,9.42
2,Air Asia,20:15,7h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,12.67
3,Air Asia,20:15,8h 20m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,11.92
4,Air Asia,16:35,8h 35m,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,8.00

In [17]:
df1.shape

(1587, 10)

In [24]:
# Out of Arrival time, departure time and duration we can remove one to avoid multicollinearity
df1.drop('Arrival Time',axis=1,inplace=True)

In [53]:
sample1=[]
sample2=[]
for i in df1['Duration']:
    k=i.split(' ')
    sample1.append(k[0])
    sample2.append(k[1])
sample3=[]
sample4=[]   
for i in sample1:
    for m in range(len(i)):
        mi=[]
        mi1=[]
        for word in i:
            if word.isdigit():
                mi.append(word)
        mi1=''.join(mi)
    sample3.append(mi1)
            
for i in sample2:
    for m in range(len(i)):
        mi=[]
        mi1=[]
        for word in i:
            if word.isdigit():
                mi.append(word)
        mi1=''.join(mi)
    sample4.append(mi1)
g=0
fin_d=[]
for i in sample3:
    fin_d.append(round((int(i)+int(sample4[g])/60),2))
    g=g+1

In [56]:
df1.drop('Duration',axis=1,inplace=True)
df1['Duration']=fin_d

In [57]:
df1.head(10)

,Company Name,No of stops,Rates,No of days in advanced booked,class,where to where,Route Value,Departure Time,Duration
0,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,8.00,6.58
1,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,9.42,6.58
2,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,12.67,7.58
3,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,11.92,8.33
4,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,8.00,8.58
5,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,18.67,11.67
6,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,16.25,14.08
7,Air Asia,1 Stop,"5,953",1,Economy,Delhi - Mumbai,3,8.58,16.08
8,Go First,Non Stop,"5,954",1,Economy,Delhi - Mumbai,3,18.83,1.92
9,Go First,Non Stop,"5,954",1,Economy,Delhi - Mumbai,3,9.08,2.00

In [50]:
df1.shape

(1587, 9)

In [58]:
df1['No of stops'].value_counts()

1 Stop       837
Non Stop     643
2 Stop(s)     87
3 Stop(s)     20
Name: No of stops, dtype: int64

In [59]:
df1['No of stops'].replace(['1 Stop','Non Stop','2 Stop(s)','3 Stop(s)'],[1,0,2,3],inplace=True)

In [60]:
df1['No of stops'].value_counts()

1    837
0    643
2     87
3     20
Name: No of stops, dtype: int64

In [74]:
price=[]
for i in df1['Rates']:
    k=[]
    k1=[]
    for j in i:
        if j !=',':
            k.append(j)
    k1=''.join(k)
    k2=int(k1)
    price.append(k2)

In [79]:
len(price)

1587

In [80]:
df1.drop('Rates',axis=1,inplace=True)

In [81]:
df1['Price']=price

In [82]:
df1.head()

,Company Name,No of stops,No of days in advanced booked,class,where to where,Route Value,Departure Time,Duration,Price
0,Air Asia,1,1,Economy,Delhi - Mumbai,3,8.00,6.58,5953
1,Air Asia,1,1,Economy,Delhi - Mumbai,3,9.42,6.58,5953
2,Air Asia,1,1,Economy,Delhi - Mumbai,3,12.67,7.58,5953
3,Air Asia,1,1,Economy,Delhi - Mumbai,3,11.92,8.33,5953
4,Air Asia,1,1,Economy,Delhi - Mumbai,3,8.00,8.58,5953

In [83]:
df1.dtypes

Company Name                      object
No of stops                        int64
No of days in advanced booked      int64
class                             object
where to where                    object
Route Value                        int64
Departure Time                   float64
Duration                         float64
Price                              int64
dtype: object

In [84]:
# extracting the dataset for tableau analysis
df1.to_csv('flight_tableau.csv')

In [85]:
df1['where to where'].value_counts()

Delhi - Mumbai        288
Delhi - Bengaluru     268
Delhi - Kolkata       258
Delhi - Hyderabad     258
Mumbai - Bengaluru    250
Delhi - Chennai       215
Mubai - Bengaluru      50
Name: where to where, dtype: int64

In [86]:
df1['where to where'].replace('Mubai - Bengaluru','Mumbai - Bengaluru',inplace=True)

In [87]:
df1['where to where'].value_counts()

Mumbai - Bengaluru    300
Delhi - Mumbai        288
Delhi - Bengaluru     268
Delhi - Kolkata       258
Delhi - Hyderabad     258
Delhi - Chennai       215
Name: where to where, dtype: int64

In [88]:
dist_list=[]
for i in df1['where to where']:
    if i =='Delhi - Mumbai':
        dist_list.append(1148)
    elif i =='Delhi - Bengaluru':
        dist_list.append(1740)
    elif i == 'Delhi - Kolkata':
        dist_list.append(1304)
    elif i =='Delhi - Hyderabad':
        dist_list.append(1253)
    elif i =='Delhi - Chennai':
        dist_list.append(1757)
    elif i =='Mumbai - Bengaluru':
        dist_list.append(842)

In [90]:
df1['distance in km']=dist_list

In [91]:
df1.head()

,Company Name,No of stops,No of days in advanced booked,class,where to where,Route Value,Departure Time,Duration,Price,distance in km
0,Air Asia,1,1,Economy,Delhi - Mumbai,3,8.00,6.58,5953,1148
1,Air Asia,1,1,Economy,Delhi - Mumbai,3,9.42,6.58,5953,1148
2,Air Asia,1,1,Economy,Delhi - Mumbai,3,12.67,7.58,5953,1148
3,Air Asia,1,1,Economy,Delhi - Mumbai,3,11.92,8.33,5953,1148
4,Air Asia,1,1,Economy,Delhi - Mumbai,3,8.00,8.58,5953,1148

In [92]:
df1.to_csv('flight_tableau.csv')